using System;
using System.Collections.Generic;
using System.Linq;
using System.Net.NetworkInformation;
using System.Text;
using System.Threading.Tasks;

namespace task3_2
{
    //Существующие классы массивов должны реализовывать соответствующие интерфейсы и определённую в них логику. В частности, базовый класс массива реализует базовый интерфейс массива. Наследники класса реализуют соответствующие им интерфейсы.
    //Необходимо добавить класс, реализующий интерфейс IPrinter для отображения на консоли дней недели.

    //В методе main нужно объявить массив типа базового интерфейса длиной от 3 элементов и создать явно по одному экземпляру класса массива каждого вида.Затем, создав их, следует в цикле для всех элементов вашего массива вызвать методы вычисления среднего и печати.
    //Также следует создать экземпляр класса по работе с днями недели.Затем необходимо создать массив всех созданных ранее объектов, которые могут быть напечатаны на консоль, и для всех них последовательно вызвать метод IPrinter.Print().


    //Для решения задачи следует сделать отдельный проект рядом с уже существующим, посвященным задачам 3-1 и 3-2.

    internal class Program
    {
        static void Main(string[] args)
        {
            Calendarik calendar = new Calendarik();
            calendar.Print();
        }
    }
}
